# SetUnderlineStatus Method (Boolean)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormattedText..::..SetUnderlineStatus Method (Boolean)
FormattedText Class See Also
---
Sets the characters in the entire text to be underlined or not underlined.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void SetUnderlineStatus(
	bool isUnderlined
)
```

Visual Basic
---
```text
Public Sub SetUnderlineStatus ( _
	isUnderlined As Boolean _
)
```

Visual C++
---
```text
public:
void SetUnderlineStatus(
	bool isUnderlined
)
```

# ### Parameters
isUnderlined
    Type: System..::..Boolean The desired underline status of characters in the entire text. True to set underlined, false to set not underlined.
# See Also
FormattedText Class
SetUnderlineStatus Overload
Autodesk.Revit.DB Namespace